In [5]:
 #### EDA Mall Customer Segmentation

In [19]:
#Import packages
import pandas as pd
import numpy as np
from collections import Counter

#For visualization
import seaborn as sns
import plotly.express as px
import matplotlib.pyplot as plt


#For other models
from sklearn.cluster import KMeans, AgglomerativeClustering, DBSCAN
from kmodes.kmodes import KModes
from kmodes import kprototypes

#Calculate distance matrix to cluster mixed data type
from scipy.spatial import distance_matrix

#For calculate solhouette_score
from sklearn.metrics import silhouette_score

#For Encoding
from sklearn.preprocessing import StandardScaler, OneHotEncoder, OrdinalEncoder


# For metrics and helpful functions
from scipy.cluster.hierarchy import linkage, dendrogram, fcluster

#warning
import warnings

In [27]:
file_path = "./data/Mall_Customers.csv"
customer_data = pd.read_csv(file_path)

In [28]:
customer_data.head(10)
print(customer_data.columns)

Index(['CustomerID', 'Gender', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

In [29]:
### Renaming the column 
customer_data = customer_data.rename(columns={"Annual Income (k$)":"Annual Income","Spending Score (1-100)":"Spending Score"})

#Display top 10 bottom data
customer_data.tail(10)

     CustomerID  Gender  Age  Annual Income  Spending Score
190         191  Female   34            103              23
191         192  Female   32            103              69
192         193    Male   33            113               8
193         194  Female   38            113              91
194         195  Female   47            120              16
195         196  Female   35            120              79
196         197  Female   45            126              28
197         198    Male   32            126              74
198         199    Male   32            137              18
199         200    Male   30            137              83

In [30]:
# Check if the dataset contains null or empty values
customer_data.isna().sum()

CustomerID        0
Gender            0
Age               0
Annual Income     0
Spending Score    0
dtype: int64

In [42]:
customer_data.duplicated().sum()

0

In [43]:
clean_data = customer_data.drop(['CustomerID'],axis=1)

In [44]:
clean_data.describe()

              Age  Annual Income  Spending Score
count  200.000000     200.000000      200.000000
mean    38.850000      60.560000       50.200000
std     13.969007      26.264721       25.823522
min     18.000000      15.000000        1.000000
25%     28.750000      41.500000       34.750000
50%     36.000000      61.500000       50.000000
75%     49.000000      78.000000       73.000000
max     70.000000     137.000000       99.000000

In [ ]:
# Create  subplot to visualize  outliers
fig = px.box(clean_data, y="Annual Income")
fig.show()